20210816194348-conference_api_quicksign.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-01 Thu 10:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>API design</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">API design</h1>

<div id="outline-container-org3384032" class="outline-2">
<h2 id="org3384032">A little friction in your design is good.</h2>
<div class="outline-text-2" id="text-org3384032">
<p>
In python there are two ways to enforce this. First with keyword-only arguments:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #d73a49;">def</span> <span style="color: #6f42c1;">function</span>(a, **, new, this):
    <span style="color: #d73a49;">pass</span>

function(0, new=1, this=2)
</pre>
</div>

<p>
Then with namedtuples or dataclasses:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #d73a49;">class</span> <span style="color: #005cc5;">Parameters</span>(NamedTuple):
    a: <span style="color: #d73a49;">int</span>
    b: <span style="color: #d73a49;">str</span>

<span style="color: #005cc5;">@dataclass</span>
<span style="color: #d73a49;">class</span> <span style="color: #005cc5;">Parameters</span>:
    a: <span style="color: #d73a49;">int</span>
    b: <span style="color: #d73a49;">str</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5330410" class="outline-2">
<h2 id="org5330410">Avoid **kwargs at all cost</h2>
<div class="outline-text-2" id="text-org5330410">
<p>
They are hard to document. Use dataclasses or namedtuples instead (similar to the Go way of doing things). This also has the advantage of putting the emphasis on your data structure, the interface with the outside world. A way to control the data (can add validation when initializing a dataclass for instance)
</p>
</div>
</div>

<div id="outline-container-org42f63d0" class="outline-2">
<h2 id="org42f63d0">Difference between a framework and a library</h2>
<div class="outline-text-2" id="text-org42f63d0">
<ul class="org-ul">
<li>Designed to do specific things</li>
<li>Composes with other libraries (composability)</li>
<li>Modularity</li>
<li>Framework already contain the base flow &amp; architecture of the application you're building (Flask vs http library)</li>
</ul>
</div>
</div>

<div id="outline-container-org02295d4" class="outline-2">
<h2 id="org02295d4">Build the conceptually right thing first, the abstraction later</h2>
</div>
<div id="outline-container-org2704b7a" class="outline-2">
<h2 id="org2704b7a">Naming is 90% of the work</h2>
<div class="outline-text-2" id="text-org2704b7a">
<p>
Take it seriously.
</p>
</div>
</div>

<div id="outline-container-org0280246" class="outline-2">
<h2 id="org0280246">Always be thinking "How much documentation am I going to have to write for this?"</h2>
<div class="outline-text-2" id="text-org0280246">
<p>
This is linked to naming. Ideally function name and name of the arguments should suffice.
</p>
</div>
</div>

<div id="outline-container-org3260eb2" class="outline-2">
<h2 id="org3260eb2">Writig the function is only 50% of the work</h2>
<div class="outline-text-2" id="text-org3260eb2">
<p>
This is junior's most frequent error. Once the code has been written they consider their job done. But you need to keep re-writing the code until it makes sense to someone else.
</p>
</div>
</div>

<div id="outline-container-orgffb560f" class="outline-2">
<h2 id="orgffb560f">Programming is <i>writing</i></h2>
<div class="outline-text-2" id="text-orgffb560f">
<p>
Hunmanities students make better programmers. Stop thinking of programming as a scientific discipline (I mean it slightly is for machine learning). You are <i>writing</i>.
</p>
</div>
</div>

<div id="outline-container-org2a7a8db" class="outline-2">
<h2 id="org2a7a8db">But mostly <i>reading</i></h2>
<div class="outline-text-2" id="text-org2a7a8db">
<p>
Code is read more often than written.
</p>
</div>
</div>

<div id="outline-container-org0f16637" class="outline-2">
<h2 id="org0f16637">OOP is usually the path to broken abstractions</h2>
<div class="outline-text-2" id="text-org0f16637">
<p>
When you create objects, you are populating a world. Bad APIs create a fantasy world, a collections of objects that have no bearing on reality.
</p>

<p>
Is Machine Learning really about creating objects? What's an algorithm? Can you eat it?
</p>

<p>
"There is an object X that does Y" vs "When I take X and apply this transformation I get Z" Stateless. If I run it twice with the same input it gives me the same result.
</p>

<p>
Sometimes combinations of transformations are useful and we give them a name: a new object or a new function.
</p>
</div>
</div>

<div id="outline-container-org00baceb" class="outline-2">
<h2 id="org00baceb">What are you preventing your users from doing?</h2>
<div class="outline-text-2" id="text-org00baceb">
<p>
We are often thinking in terms of what our API allows users to do, less in terms about what it prevents them from doing. In some cases creating a sandbox is good (framework), but sometimes it is frustrating (library).
</p>
</div>
</div>
<div id="outline-container-org6b0ee18" class="outline-2">
<h2 id="org6b0ee18">You need to have trap doors, way to escape your leaky abstractions</h2>
<div class="outline-text-2" id="text-org6b0ee18">
<p>
The Julia language is great with that. You can always act on the abstraction layer below.
</p>
</div>
</div>
<div id="outline-container-org2311a17" class="outline-2">
<h2 id="org2311a17">A model is a combination of arrays and operations on arrays.</h2>
<div class="outline-text-2" id="text-org2311a17">
<p>
Write that first.
</p>
</div>
</div>
<div id="outline-container-orgc588010" class="outline-2">
<h2 id="orgc588010">API = abstraction. All abstractions suck.</h2>
</div>
<div id="outline-container-org5b5a980" class="outline-2">
<h2 id="org5b5a980">Naming</h2>
<div class="outline-text-2" id="text-org5b5a980">
<p>
There is a joke in CS that naming is the hardest thing in programming along with cache invalidation. Except it is not a joke. Naming is hard, and good names go a loooong way.
</p>

<p>
Why do poiticians use vague terms? Allow people to project whatever people want on them. Don't code like a politician. Be pedantic.
</p>
</div>
</div>

<div id="outline-container-org08e137a" class="outline-2">
<h2 id="org08e137a">Favorite APIs</h2>
<div class="outline-text-2" id="text-org08e137a">
<ul class="org-ul">
<li><code>numpy</code>, I rarely have any surprises with functions I discover for the first time;</li>
<li><code>schedule</code></li>
<li><code>jax</code></li>
</ul>
</div>
</div>

<div id="outline-container-org23439a7" class="outline-2">
<h2 id="org23439a7">Choose COMPOSITION OVER CONFIGURATION</h2>
</div>
<div id="outline-container-org4c4eafe" class="outline-2">
<h2 id="org4c4eafe">Interchangeable elements should have the same signature</h2>
</div>
<div id="outline-container-orge7e9255" class="outline-2">
<h2 id="orge7e9255">Please do not reinvent the wheel!</h2>
<div class="outline-text-2" id="text-orge7e9255">
<p>
In doubt do like numpy. Example of theano is partially hard to use because it uses different naming and type casting conventions.
</p>

<p>
You are not going to do better than numpy; if you do <b>no one</b> will adopt your conventions.
</p>

<p>
<code>import jax.numpy as jnp</code> and <code>import theano.tensor as tt</code>
</p>

<p>
JAX feels like the natural extension of numpy to which it adds:
</p>
<ul class="org-ul">
<li>JIT-compilation <code>jax.jit(fn)</code></li>
<li>SIMD mapping <code>jax.vmap(fn)</code> or <code>jax.pmap(fn)</code></li>
<li>forward and backward autodiff: <code>jax.grad(fn)</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #d73a49;">def</span> <span style="color: #6f42c1;">function</span>(x):
    <span style="color: #24292e;">y</span> = jnp.exp(x)
    <span style="color: #d73a49;">return</span> y
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeeb601b" class="outline-2">
<h2 id="orgeeb601b">Modular internals may not make a difference to end users, but it does to maintainer. Do not only think about the user!</h2>
</div>

<div id="outline-container-org834533e" class="outline-2">
<h2 id="org834533e">Links to this note</h2>
<div class="outline-text-2" id="text-org834533e">
<ul class="org-ul">
<li><a href="./inbox.html">Writing inbox</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>